weedmanu/STM32_Libraries/STM32_MP25/STM32_MP25.c
/*
 * STM32_MP25.c
 *
 *  Created on: Sep 6, 2025
 *      Author: weedm
 */

// -----------------------------------------------------------------------------
//  INCLUDES
// -----------------------------------------------------------------------------
#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "stm32l4xx_hal.h"
#include "STM32_MP25.h"

static int pm25_debug_mode = 0;

// -----------------------------------------------------------------------------
//  MACROS
// -----------------------------------------------------------------------------
#define PM25_DEBUG_PRINT(...)    \
    do                           \
    {                            \
        if (pm25_debug_mode)     \
            printf(__VA_ARGS__); \
    } while (0)

// -----------------------------------------------------------------------------
//  OPTIMISATION: Extraction des champs optimisée (évite répétitions)
// -----------------------------------------------------------------------------
static void pm25_extract_fields(PM25_FullData *data, const uint8_t *frame)
{
    // Copie optimisée du frame brut
    memcpy(data->raw_frame, frame, PM25_FRAME_LEN);

    // Extraction optimisée avec pointeur pour éviter calculs répétés
    const uint8_t *ptr = frame + 4; // Commencer après header+length

    // Utiliser une boucle pour les extractions répétitives
    uint16_t *fields[] = {
        &data->pm1_0_standard, &data->pm2_5_standard, &data->pm10_standard,
        &data->pm1_0_atmospheric, &data->pm2_5_atmospheric, &data->pm10_atmospheric,
        &data->particles_0_3um, &data->particles_0_5um, &data->particles_1_0um,
        &data->particles_2_5um, &data->particles_5_0um, &data->particles_10um};

    for (int i = 0; i < 12; i++)
    {
        *fields[i] = (ptr[0] << 8) | ptr[1];
        ptr += 2;
    }

    data->version = frame[28];
    data->checksum = (frame[30] << 8) | frame[31];
}

// -----------------------------------------------------------------------------
//  OPTIMISATION: Lecture UART optimisée (évite memmove répété)
// -----------------------------------------------------------------------------

// Variables globales pour la pin SET
static GPIO_TypeDef *pm25_set_port = NULL;
static uint16_t pm25_set_pin = 0;
// static UART_HandleTypeDef *pm25_uart_handle = NULL; // supprimé, non utilisé

void PM25_SetControlPin(GPIO_TypeDef *port, uint16_t pin)
{
    pm25_set_port = port;
    pm25_set_pin = pin;
}

// --- Async/DMA public flags used by IRQ handlers in project (exported symbols)
volatile uint8_t usart1_idle_flag = 0;
volatile unsigned long dma1_head_snapshot = 0;

// Async DMA internals
uint8_t async_buffer[PM25_FRAME_LEN * 2]; // circular DMA buffer

// -----------------------------------------------------------------------------
//  API Async / DMA minimal
// -----------------------------------------------------------------------------
void PM25_Init(UART_HandleTypeDef *huart)
{
    // backward-compatible initialization
    // Initialisation réelle à placer ici si besoin
    HAL_Delay(2000); // Attendre la stabilisation
    PM25_DEBUG_PRINT("[PM25 DEBUG] Init capteur PM2.5 terminée (capteur en veille)\n");
}

// -----------------------------------------------------------------------------
//  FONCTIONS D'INITIALISATION
// -----------------------------------------------------------------------------

void PM25_SetDebugMode(int enable)
{
    pm25_debug_mode = enable;
}

// -----------------------------------------------------------------------------
//  OPTIMISATION: Mode périodique ultra-efficace (meilleure économie CPU)
// -----------------------------------------------------------------------------
int PM25_Polling_ReadFull(UART_HandleTypeDef *huart, PM25_FullData *data, unsigned long interval_ms)
{
    static unsigned long last_reading_time = 0;
    static uint8_t buffer[PM25_FRAME_LEN * 2]; // Buffer circulaire statique
    static int head = 0;
    static unsigned long activation_time = 0;
    static int state = 0; // 0: veille, 1: activation, 2: lecture

    unsigned long current_time = HAL_GetTick();

    switch (state)
    {
    case 0: // Mode veille
        if ((current_time - last_reading_time) >= interval_ms)
        {
            // Activer le capteur
            HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_SET);
            activation_time = current_time;
            state = 1;
            PM25_DEBUG_PRINT("[PM25 DEBUG] SET -> HIGH (activation optimisée)\n");
            return -1; // En cours d'activation
        }
        return -1; // Toujours en veille

    case 1: // Attente activation capteur
        if ((current_time - activation_time) >= 1000)
        { // 1s pour activation
            state = 2;
            head = 0; // Reset buffer
            PM25_DEBUG_PRINT("[PM25 DEBUG] Capteur prêt, début lecture optimisée\n");
        }
        return -1; // Toujours en activation

    case 2: // Lecture rapide
        // Essayer de lire un octet (timeout court pour ne pas bloquer)
        uint8_t b;
        HAL_StatusTypeDef status = HAL_UART_Receive(huart, &b, 1, 10); // 10ms timeout

        if (status == HAL_OK)
        {
            // Ajouter l'octet au buffer circulaire
            buffer[head] = b;
            head = (head + 1) % (PM25_FRAME_LEN * 2);

            // Vérifier si on a assez de données pour une trame complète
            if (head >= PM25_FRAME_LEN)
            {
                int window_start = (head - PM25_FRAME_LEN + (PM25_FRAME_LEN * 2)) % (PM25_FRAME_LEN * 2);

                // Vérifier le header
                if (buffer[window_start] == 0x42 && buffer[(window_start + 1) % (PM25_FRAME_LEN * 2)] == 0x4D)
                {
                    // Extraire la trame
                    uint8_t frame[PM25_FRAME_LEN];
                    for (int i = 0; i < PM25_FRAME_LEN; i++)
                    {
                        frame[i] = buffer[(window_start + i) % (PM25_FRAME_LEN * 2)];
                    }

                    // Vérifier le checksum
                    if (PM25_Validate_Checksum(frame))
                    {
                        PM25_DEBUG_PRINT("[PM25 DEBUG] Trame valide trouvée (optimisée)\n");
                        pm25_extract_fields(data, frame);

                        // Remettre en veille
                        HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                        last_reading_time = current_time;
                        state = 0;
                        PM25_DEBUG_PRINT("[PM25 DEBUG] SET -> LOW (retour veille optimisée)\n");
                        return 1; // Succès
                    }
                }
            }
            return -1; // Continue à lire
        }
        else
        {
            // Timeout de lecture, vérifier si on doit abandonner
            if ((current_time - activation_time) > 3000)
            { // 3s max pour lecture
                PM25_DEBUG_PRINT("[PM25 DEBUG] Timeout lecture optimisée\n");
                HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                last_reading_time = current_time;
                state = 0;
                return 0; // Échec
            }
            return -1; // Continue d'essayer
        }
    }

