weedmanu/STM32_Libraries/STM32_MP25/STM32_MP25.c
    return -1; // État inconnu
}

/**
 * @brief Vérifie l'en-tête d'une trame (0x42 0x4D)
 * @param frame Trame brute reçue
 * @return 1 si header valide, 0 sinon
 */
int PM25_Validate_Header(const uint8_t *frame)
{
    int valid = (frame[0] == 0x42 && frame[1] == 0x4D);
    PM25_DEBUG_PRINT("[PM25 DEBUG] Header validation: 0x%02X 0x%02X = %s\n",
                     frame[0], frame[1], valid ? "OK" : "ERREUR");
    return valid;
}

/**
 * @brief Vérifie le checksum d'une trame
 * @param frame Trame brute reçue
 * @return 1 si checksum OK, 0 sinon
 */
int PM25_Validate_Checksum(const uint8_t *frame)
{
    uint16_t sum = 0;
    // Somme optimisée des 30 premiers octets
    for (int i = 0; i < 30; i++)
        sum += frame[i];
    uint16_t chk = (frame[30] << 8) | frame[31];
    PM25_DEBUG_PRINT("[PM25 DEBUG] Checksum calculé: 0x%04X, reçu: 0x%04X (pos 30-31)\n", sum, chk);
    return (sum == chk);
}

// -----------------------------------------------------------------------------
//  FONCTIONS D'INTERPRETATION QUALITE AIR
// -----------------------------------------------------------------------------
/**
 * @brief Calcule le code de qualité d'air basé sur la valeur PM et le type
 * @param pm Valeur PM mesurée
 * @param type Type de mesure ("PM1.0", "PM2.5", "PM10")
 * @return Code de qualité (1=Très bon, 2=Bon, ... 6=Très mauvais)
 */
int PM25_Quality_GetCode(uint16_t pm, const char *type)
{
    if (strcmp(type, "PM2.5") == 0)
    {
        if (pm <= 10)
            return 1;
        else if (pm <= 20)
            return 2;
        else if (pm <= 25)
            return 3;
        else if (pm <= 50)
            return 4;
        else if (pm <= 75)
            return 5;
        else
            return 6;
    }
    else if (strcmp(type, "PM10") == 0)
    {
        if (pm <= 20)
            return 1;
        else if (pm <= 40)
            return 2;
        else if (pm <= 50)
            return 3;
        else if (pm <= 100)
            return 4;
        else if (pm <= 150)
            return 5;
        else
            return 6;
    }
    else
    {
        if (pm <= 10)
            return 1;
        else if (pm <= 20)
            return 2;
        else if (pm <= 25)
            return 3;
        else if (pm <= 50)
            return 4;
        else if (pm <= 75)
            return 5;
        else
            return 6;
    }
}

/**
 * @brief Interprète un code de qualité en informations lisibles
 * @param code Code de qualité (1-6)
 * @return Structure contenant emoji, label et description
 */
PM_StatusInfo PM25_Quality_InterpretCode(int code)
{
    switch (code)
    {
    case 1:
        return (PM_StatusInfo){1, "🟢", "Très bon", "Qualité de l'air excellente."};
    case 2:
        return (PM_StatusInfo){2, "🟡", "Bon", "Qualité de l'air satisfaisante."};
    case 3:
        return (PM_StatusInfo){3, "🟠", "Moyen", "Qualité acceptable pour tous."};
    case 4:
        return (PM_StatusInfo){4, "🔴", "Dégradé", "Risque pour personnes sensibles."};
    case 5:
        return (PM_StatusInfo){5, "🟣", "Mauvais", "Risque pour la santé générale."};
    case 6:
        return (PM_StatusInfo){6, "⚫", "Très mauvais", "Évitez les activités extérieures."};
    default:
        return (PM_StatusInfo){0, "❓", "Inconnu", "Valeur non reconnue."};
    }
}

// -----------------------------------------------------------------------------
//  FONCTIONS D'INTERPRETATION RATIO
// -----------------------------------------------------------------------------
/**
 * @brief Calcule le code de ratio PM2.5/PM10
 * @param pm25 Valeur PM2.5
 * @param pm10 Valeur PM10
 * @return Code ratio (1=PM10 dominant, 2=équilibré, 3=PM2.5 dominant, 4=PM2.5 très dominant)
 */
int PM25_Ratio_GetCode(uint16_t pm25, uint16_t pm10)
{
    float ratio = pm10 > 0 ? (float)pm25 / pm10 : 0.0f;
    if (ratio < 0.5f)
        return 1; // PM10 dominant
    else if (ratio < 0.8f)
        return 2; // Ratio équilibré
    else if (ratio < 1.2f)
        return 3; // PM2.5 dominant
    else
        return 4; // PM2.5 très dominant
}

/**
 * @brief Interprète un code de ratio PM2.5/PM10
 * @param code Code ratio (1-4)
 * @return Structure pastille (emoji, label, description)
 */
PM_StatusInfo PM25_Ratio_Interpret(int code)
{
    switch (code)
    {
    case 1:
        return (PM_StatusInfo){1, "🔵", "PM10 dominant", "Pollution PM10 prédominante."};
    case 2:
        return (PM_StatusInfo){2, "🟡", "Équilibré", "Pollution mixte PM2.5/PM10."};
    case 3:
        return (PM_StatusInfo){3, "🟠", "PM2.5 dominant", "PM2.5 légèrement dominant."};
    case 4:
        return (PM_StatusInfo){4, "🔴", "PM2.5 très dominant", "Pollution PM2.5 prédominante."};
    default:
        return (PM_StatusInfo){0, "❓", "Inconnu", "Ratio non reconnu."};
    }
}

// -----------------------------------------------------------------------------
//  NOUVELLE FONCTION DMA AVEC ÉTATS COMME POLLING
// -----------------------------------------------------------------------------
int PM25_DMA_ReadFull_IT(UART_HandleTypeDef *huart, PM25_FullData *data, unsigned long interval_ms)
{
    static unsigned long last_reading_time = 0;
    static unsigned long activation_time = 0;
    static int state = 0; // 0: veille, 1: activation, 2: lecture DMA
    static int dma_started = 0;
    unsigned long current_time = HAL_GetTick();

    switch (state)
    {
    case 0: // Mode veille
        if (interval_ms == 0 || (current_time - last_reading_time) >= interval_ms)
        {
            // Mode continu : pas d'attente entre lectures
            if (interval_ms == 0 && state == 0)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] Mode continu activé\n");
            }

            // Vérifier que DMA n'est pas déjà actif
            if (dma_started)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] DMA encore actif, arrêt forcé\n");
                HAL_UART_DMAStop(huart);
                __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
                dma_started = 0;
                HAL_Delay(100);
            }

            // Vérifier l'état du UART
            if (HAL_UART_GetState(huart) != HAL_UART_STATE_READY)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] UART pas prêt, réinitialisation...\n");
                HAL_UART_DeInit(huart);
                HAL_Delay(50);
            }

