weedmanu/STM32_Libraries/STM32_MP25/STM32_MP25.c
            // Petite pause pour stabilité avant activation
            HAL_Delay(100);
            // Activer le capteur
            HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_SET);
            activation_time = current_time;
            state = 1;
            dma_started = 0;
            PM25_DEBUG_PRINT("[PM25 DMA IT] SET -> HIGH (activation)\n");
            return -1; // En cours d'activation
        }
        return -1; // Toujours en veille

    case 1: // Attente activation capteur
        if ((current_time - activation_time) >= 1000)
        { // 1s pour activation
            state = 2;
            // Nettoyer le buffer avant de démarrer DMA
            memset(async_buffer, 0, sizeof(async_buffer));
            usart1_idle_flag = 0; // Reset flag

            // S'assurer que DMA est bien arrêté avant de redémarrer
            if (dma_started)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] Arrêt DMA en cours...\n");
                HAL_UART_DMAStop(huart);
                __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
                dma_started = 0;
                HAL_Delay(100); // Pause plus longue pour stabilité
            }

            // Réinitialiser le canal DMA si nécessaire
            if (huart->hdmarx != NULL)
            {
                // Réinitialiser le stream DMA
                HAL_DMA_Abort(huart->hdmarx);
                HAL_Delay(50);
            }

            PM25_DEBUG_PRINT("[PM25 DMA IT] Tentative démarrage DMA...\n");
            // Démarrer DMA pour recevoir les données
            HAL_StatusTypeDef dma_status = HAL_UART_Receive_DMA(huart, async_buffer, sizeof(async_buffer));
            if (dma_status == HAL_OK)
            {
                __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
                dma_started = 1;
                PM25_DEBUG_PRINT("[PM25 DMA IT] Capteur prêt, DMA démarrée avec succès\n");
            }
            else
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] Erreur démarrage DMA - Status: %d, UART State: %ld\n", dma_status, HAL_UART_GetState(huart));
                HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                last_reading_time = current_time;
                state = 0;
                return 0; // Échec
            }
        }
        return -1; // Toujours en activation

    case 2: // Lecture avec DMA
    {
        current_time = HAL_GetTick(); // Mettre à jour le temps pour cette case

        // Debug: vérifier si DMA reçoit des données
        static unsigned long last_debug_time = 0;
        if ((current_time - last_debug_time) > 1000) // Debug toutes les secondes
        {
            if (huart->hdmarx != NULL)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] DMA handle OK, flag IDLE: %d\n", usart1_idle_flag);
            }
            else
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] DMA handle NULL, flag IDLE: %d\n", usart1_idle_flag);
            }
            last_debug_time = current_time;
        }

        // Attendre que l'interruption IDLE signale l'arrivée de données
        if (usart1_idle_flag)
        {
            PM25_DEBUG_PRINT("[PM25 DMA IT] Interruption IDLE reçue!\n");
            usart1_idle_flag = 0;

            // Scanner le buffer pour trouver le header valide
            uint16_t buffer_size = sizeof(async_buffer);
            int found = 0;

            for (uint16_t i = 0; i < buffer_size - PM25_FRAME_LEN; i++)
            {
                if (async_buffer[i] == 0x42 && async_buffer[i + 1] == 0x4D)
                {
                    // Header trouvé, vérifier la trame complète
                    uint8_t frame[PM25_FRAME_LEN];
                    for (int j = 0; j < PM25_FRAME_LEN; j++)
                    {
                        frame[j] = async_buffer[i + j];
                    }

                    if (PM25_Validate_Checksum(frame))
                    {
                        PM25_DEBUG_PRINT("[PM25 DMA IT] Trame valide trouvée à position %d\n", i);
                        pm25_extract_fields(data, frame);
                        found = 1;

                        // Mode continu : ne pas arrêter le DMA, continuer à recevoir
                        if (interval_ms == 0)
                        {
                            PM25_DEBUG_PRINT("[PM25 DMA IT] Mode continu : trame traitée, DMA reste actif\n");
                            last_reading_time = current_time;
                            activation_time = current_time; // Reset timer pour éviter timeout en continu
                            // Rester dans l'état 2 pour continuer à recevoir
                            return 1; // Succès, mais continuer
                        }
                        else
                        {
                            // Mode périodique : arrêter DMA et remettre en veille
                            if (dma_started)
                            {
                                PM25_DEBUG_PRINT("[PM25 DMA IT] Arrêt DMA après succès...\n");
                                HAL_UART_DMAStop(huart);
                                __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
                                dma_started = 0;
                            }

                            // Remettre en veille
                            HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                            last_reading_time = current_time;
                            state = 0;
                            PM25_DEBUG_PRINT("[PM25 DMA IT] SET -> LOW (retour veille)\n");
                            return 1; // Succès
                        }
                    }
                }
            }

            if (!found)
            {
                PM25_DEBUG_PRINT("[PM25 DMA IT] Aucune trame valide trouvée dans le buffer\n");
                // Continuer à attendre (peut-être données partielles)
                return -1;
            }
        }
        else
        {
            // Timeout de lecture, vérifier si on doit abandonner
            unsigned long timeout_limit = (interval_ms == 0) ? 10000 : 3000; // 10s en continu, 3s en périodique

            if ((current_time - activation_time) > timeout_limit)
            { // Timeout adapté au mode
                PM25_DEBUG_PRINT("[PM25 DMA IT] Timeout lecture DMA (mode: %s)\n", interval_ms == 0 ? "continu" : "périodique");

                if (interval_ms == 0)
                {
                    // Mode continu : attendre l'interruption IDLE avant de redémarrer
                    PM25_DEBUG_PRINT("[PM25 DMA IT] Mode continu : attente interruption UART avant redémarrage DMA\n");

                    // Arrêter DMA proprement
                    if (dma_started)
                    {
                        HAL_UART_DMAStop(huart);
                        __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
                        dma_started = 0;
                        HAL_Delay(200); // Pause pour stabilization
                    }

