weedmanu/STM32_Libraries/STM32_MP25/STM32_MP25.c
                    // Attendre que l'UART soit vraiment idle (pas de données en cours)
                    static unsigned long wait_idle_start = 0;
                    if (wait_idle_start == 0)
                    {
                        wait_idle_start = HAL_GetTick();
                        PM25_DEBUG_PRINT("[PM25 DMA IT] Attente UART idle...\n");
                    }

                    // Attendre jusqu'à 5 secondes pour que l'UART signale idle en mode continu
                    if ((HAL_GetTick() - wait_idle_start) < 5000)
                    {
                        // Vérifier si l'UART a signalé idle pendant l'attente
                        if (usart1_idle_flag)
                        {
                            PM25_DEBUG_PRINT("[PM25 DMA IT] UART idle détecté, redémarrage DMA\n");
                            usart1_idle_flag = 0;
                            wait_idle_start = 0;

                            // Redémarrer DMA
                            memset(async_buffer, 0, sizeof(async_buffer));
                            if (HAL_UART_Receive_DMA(huart, async_buffer, sizeof(async_buffer)) == HAL_OK)
                            {
                                __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
                                dma_started = 1;
                                activation_time = HAL_GetTick(); // Reset timer après redémarrage
                                PM25_DEBUG_PRINT("[PM25 DMA IT] DMA redémarré après attente idle\n");
                            }
                            else
                            {
                                PM25_DEBUG_PRINT("[PM25 DMA IT] Échec redémarrage DMA après attente idle\n");
                                // Remettre en veille et réessayer plus tard
                                HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                                last_reading_time = current_time;
                                state = 0;
                                return 0;
                            }
                        }
                        else
                        {
                            // Continuer à attendre
                            return -1;
                        }
                    }
                    else
                    {
                        // Timeout d'attente idle, forcer le redémarrage
                        PM25_DEBUG_PRINT("[PM25 DMA IT] Timeout attente idle, redémarrage forcé\n");
                        wait_idle_start = 0;

                        memset(async_buffer, 0, sizeof(async_buffer));
                        usart1_idle_flag = 0;
                        if (HAL_UART_Receive_DMA(huart, async_buffer, sizeof(async_buffer)) == HAL_OK)
                        {
                            __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
                            dma_started = 1;
                            activation_time = HAL_GetTick(); // Reset timer après redémarrage forcé
                            PM25_DEBUG_PRINT("[PM25 DMA IT] DMA redémarré après timeout forcé\n");
                        }
                        else
                        {
                            PM25_DEBUG_PRINT("[PM25 DMA IT] Échec redémarrage DMA après timeout forcé\n");
                            HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                            last_reading_time = current_time;
                            state = 0;
                            return 0;
                        }
                    }
                }
                else
                {
                    // Mode périodique : arrêter tout
                    if (dma_started)
                    {
                        HAL_UART_DMAStop(huart);
                        __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
                        dma_started = 0;
                    }
                    HAL_GPIO_WritePin(pm25_set_port, pm25_set_pin, GPIO_PIN_RESET);
                    last_reading_time = current_time;
                    state = 0;
                    return 0; // Échec
                }
            }
            return -1; // Continue d'attendre les données
        }
    }
    }

    return -1; // État inconnu
}
